---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.PathReinforcementType
source: html/21dc42b0-67dd-b3a6-6445-fe071a41b5ed.htm
---
# PathReinforcementType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.